export const ru = {
    Message_Sent_By_User:
        "Сообщение отправлено пользователем __username__: __text__",
    Processing_Image: "Обрабатываю ваше изображение, пожалуйста, подождите ...",
    Image_Validation_Successful: "Проверка изображения прошла успешно.",
    Valid_Image_Received:
        "Получено действительное изображение. Обрабатываю ваше местоположение ...",
    Failed_To_Process_Image: "Не удалось обработать ваше изображение:",
    Image_Validation_Failed: "Проверка изображения не удалась.",
    Uploaded_Image_Not_Valid:
        "Загруженное изображение недействительно. Попробуйте еще раз с другим изображением.",
    Location_Detected: "Местоположение обнаружено",
    App_User_Not_Found: "Пользователь приложения не найден.",
    App_User_Not_Found_Try_Later:
        "Пользователь приложения не найден. Попробуйте позже.",
    Provide_Valid_Location:
        "Пожалуйста, сначала укажите действительное местоположение.",
    Location_Set:
        "Привет __username__, ваше местоположение установлено: __location__. __text__",
    Failed_To_Process_Message:
        "Не удалось обработать ваше сообщение. Попробуйте позже.",
    Trip_Channel_Created:
        "Ваш канал путешествий __channelname__ успешно создан! Приятного путешествия! 🚀",
    Provide_Trip_Channel_Name:
        "Пожалуйста, укажите название канала путешествий. Использование: `/trip create <название-канала>`",
    Model_Selection: "Выбор модели",
    AI_Model_Used_For_Inference: "Модель ИИ, используемая для вывода.",
    API_Key_For_LLM: "API-ключ для доступа к модели LLM.",
    API_Endpoint_For_Inference: "Конечная точка API, используемая для вывода.",
    Welcome_User:
        "Привет __username__ 👋, я ваш Помощник путешественника! \n __welcomeMessage__",
    Room_Does_Not_Exist: "Комната не существует",
    API_Configuration_Missing:
        "Отсутствует конфигурация API. Обратитесь к администратору.",
    Failed_To_Process_Image_With_Error:
        "Не удалось обработать ваше изображение: __error__, Обратитесь к администратору.",
    Failed_To_Send_Message: "Не удалось отправить сообщение: __error__",
    Enjoying_Trip_At_Location:
        "О! Вы наслаждаетесь поездкой в __location__. Хотите использовать это местоположение?",
    No_Location_Found_To_Confirm:
        "Не найдено местоположение для подтверждения.",
    Unable_To_Store_Location_System_Error:
        "Не удается сохранить ваше местоположение из-за системной ошибки. Попробуйте позже.",
    Cannot_Detect_Location:
        "Мы не можем автоматически определить ваше местоположение. Поделитесь с нами своим местоположением, чтобы продолжить. Мы будем использовать IP-адрес вашего устройства для определения местоположения.",
    Location_Required_To_Continue:
        "Вы знаете, что мы не можем помочь вам без вашего местоположения, верно? Укажите ваше местоположение, чтобы продолжить.",
    Location_Coordinates:
        "Координаты вашего местоположения: __latitude__, __longitude__",
    Share_Location: "Поделиться местоположением",
    Not_Now: "Не сейчас",
    Unable_To_Retrieve_Location_From_IP:
        "Не удается получить местоположение по IP-адресу.",
    Your_Location_Display: "Ваше местоположение: __displayName__",
    Enter_Your_Location: "Введите ваше местоположение",
    Submit: "Отправить",
    Close: "Закрыть",
    Select_Your_Location: "Выберите ваше местоположение",
    Room_Name_Already_Exists:
        "Название комнаты '__roomName__' уже существует. Вы можете продолжить с этой комнатой.",
    Location_Stored_Successfully:
        "Ваше местоположение сохранено как: __location__. Теперь вы можете спрашивать информацию о путешествиях!",
};
